In [ ]:
import numpy as np 
import matplotlib.pyplot as plt
import pandas as pd

In [ ]:
titanic_df = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/fa71405126017e6a37bea592440b4bee94bf7b9e/titanic.csv")
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
titanic_df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
titanic_df = titanic_df.dropna() # скидываем NaN
titanic_df

     PassengerId  Survived  Pclass  ...     Fare        Cabin  Embarked
1              2         1       1  ...  71.2833          C85         C
3              4         1       1  ...  53.1000         C123         S
6              7         0       1  ...  51.8625          E46         S
10            11         1       3  ...  16.7000           G6         S
11            12         1       1  ...  26.5500         C103         S
..           ...       ...     ...  ...      ...          ...       ...
871          872         1       1  ...  52.5542          D35         S
872          873         0       1  ...   5.0000  B51 B53 B55         S
879          880         1       1  ...  83.1583          C50         C
887          888         1       1  ...  30.0000          B42         S
889          890         1       1  ...  30.0000         C148         C

[183 rows x 12 columns]

##Drop columns

In [ ]:
titanic_df = titanic_df.drop(columns=['Ticket', 'PassengerId', 'Cabin', 'Name'])

##Change sex

In [ ]:
titanic_df = titanic_df.replace('male', 0)
titanic_df = titanic_df.replace('female', 1)
titanic_df

     Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
1           1       1    1  38.0      1      0  71.2833        C
3           1       1    1  35.0      1      0  53.1000        S
6           0       1    0  54.0      0      0  51.8625        S
10          1       3    1   4.0      1      1  16.7000        S
11          1       1    1  58.0      0      0  26.5500        S
..        ...     ...  ...   ...    ...    ...      ...      ...
871         1       1    1  47.0      1      1  52.5542        S
872         0       1    0  33.0      0      0   5.0000        S
879         1       1    1  56.0      0      1  83.1583        C
887         1       1    1  19.0      0      0  30.0000        S
889         1       1    0  26.0      0      0  30.0000        C

[183 rows x 8 columns]

##Age float to int

In [ ]:
titanic_df['Age'] = titanic_df['Age'].astype(int)
titanic_df.dtypes

Survived      int64
Pclass        int64
Sex           int64
Age           int64
SibSp         int64
Parch         int64
Fare        float64
Embarked     object
dtype: object

## Aggregation Family size

In [ ]:
titanic_df['FamilySize'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
#titanic_df = titanic_df.drop(columns=['SibSp', 'Parch'])

In [ ]:
titanic_df

     Survived  Pclass  Sex  Age  SibSp  Parch     Fare Embarked  FamilySize
1           1       1    1   38      1      0  71.2833        C           2
3           1       1    1   35      1      0  53.1000        S           2
6           0       1    0   54      0      0  51.8625        S           1
10          1       3    1    4      1      1  16.7000        S           3
11          1       1    1   58      0      0  26.5500        S           1
..        ...     ...  ...  ...    ...    ...      ...      ...         ...
871         1       1    1   47      1      1  52.5542        S           3
872         0       1    0   33      0      0   5.0000        S           1
879         1       1    1   56      0      1  83.1583        C           2
887         1       1    1   19      0      0  30.0000        S           1
889         1       1    0   26      0      0  30.0000        C           1

[183 rows x 9 columns]

##Code Embarkes

In [ ]:
titanic_df['Embarked'] = titanic_df['Embarked'].map({'C':0, 'Q':1, 'S':2})

In [ ]:
titanic_df

     Survived  Pclass  Sex  Age  SibSp  Parch     Fare  Embarked  FamilySize
1           1       1    1   38      1      0  71.2833         0           2
3           1       1    1   35      1      0  53.1000         2           2
6           0       1    0   54      0      0  51.8625         2           1
10          1       3    1    4      1      1  16.7000         2           3
11          1       1    1   58      0      0  26.5500         2           1
..        ...     ...  ...  ...    ...    ...      ...       ...         ...
871         1       1    1   47      1      1  52.5542         2           3
872         0       1    0   33      0      0   5.0000         2           1
879         1       1    1   56      0      1  83.1583         0           2
887         1       1    1   19      0      0  30.0000         2           1
889         1       1    0   26      0      0  30.0000         0           1

[183 rows x 9 columns]

##Classificators

In [ ]:
titanic_df

     Survived  Pclass  Sex  Age  SibSp  Parch     Fare  Embarked  FamilySize
1           1       1    1   38      1      0  71.2833         0           2
3           1       1    1   35      1      0  53.1000         2           2
6           0       1    0   54      0      0  51.8625         2           1
10          1       3    1    4      1      1  16.7000         2           3
11          1       1    1   58      0      0  26.5500         2           1
..        ...     ...  ...  ...    ...    ...      ...       ...         ...
871         1       1    1   47      1      1  52.5542         2           3
872         0       1    0   33      0      0   5.0000         2           1
879         1       1    1   56      0      1  83.1583         0           2
887         1       1    1   19      0      0  30.0000         2           1
889         1       1    0   26      0      0  30.0000         0           1

[183 rows x 9 columns]

##Models

In [ ]:
from sklearn.linear_model import LogisticRegression 
from sklearn.model_selection import train_test_split 
from sklearn.tree import DecisionTreeClassifier
from sklearn.svm import SVC

**Поготовка данных**

In [ ]:
X = titanic_df[['Pclass', 'Sex', 'Age', 'Fare', 'Embarked', 'FamilySize', 'SibSp', 'Parch']]
y = titanic_df['Survived']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.10)

In [ ]:
model = LogisticRegression(C=1, penalty='l1', max_iter=10000,solver='saga', multi_class='multinomial')
model.fit(X_train, y_train)
print(model.score(X_test, y_test))

0.8421052631578947

In [ ]:
decTree = DecisionTreeClassifier()
decTree.fit(X_train, y_train)
print(decTree.score(X_test, y_test))

0.8421052631578947

In [ ]:
svc = SVC(kernel='linear', C=10, probability=True, random_state=0)
svc.fit(X_train, y_train)
print(svc.score(X_test, y_test))

0.8947368421052632

##Report

In [ ]:
from sklearn.metrics import classification_report
target_names = ['dead', 'alive']
print(classification_report(y_test, svc.predict(X_test), target_names=target_names))
print(classification_report(y_test, decTree.predict(X_test), target_names=target_names))
print(classification_report(y_test, model.predict(X_test), target_names=target_names))

              precision    recall  f1-score   support

        dead       0.75      0.75      0.75         4
       alive       0.93      0.93      0.93        15

    accuracy                           0.89        19
   macro avg       0.84      0.84      0.84        19
weighted avg       0.89      0.89      0.89        19

              precision    recall  f1-score   support

        dead       0.67      0.50      0.57         4
       alive       0.88      0.93      0.90        15

    accuracy                           0.84        19
   macro avg       0.77      0.72      0.74        19
weighted avg       0.83      0.84      0.83        19

              precision    recall  f1-score   support

        dead       0.67      0.50      0.57         4
       alive       0.88      0.93      0.90        15

    accuracy                           0.84        19
   macro avg       0.77      0.72      0.74        19
weighted avg       0.83      0.84      0.83        19

**Graph**